In [15]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [16]:
df = pd.read_csv('synthetic_beverage_sales_data.csv')

In [3]:
df.head()

,Order_ID,Customer_ID,Customer_Type,Product,Category,Unit_Price,Quantity,Discount,Total_Price,Region,Order_Date
0,ORD13428,CUS4637,B2B,Rauch Multivitamin,Juices,4.08,73,0.15,253.16,Niedersachsen,02-06-2023
1,ORD13428,CUS4637,B2B,Vittel,Water,0.78,83,0.10,58.27,Niedersachsen,02-06-2023
2,ORD13428,CUS4637,B2B,Merlot,Alcoholic Beverages,8.97,69,0.10,557.04,Niedersachsen,02-06-2023
3,ORD13428,CUS4637,B2B,Erdinger Weißbier,Alcoholic Beverages,1.79,21,0.05,35.71,Niedersachsen,02-06-2023
4,ORD13429,CUS9039,B2B,Gerolsteiner,Water,0.92,79,0.05,69.05,Bremen,08-04-2023

In [4]:
print(df.isnull().sum())

Order_ID         0
Customer_ID      0
Customer_Type    0
Product          0
Category         0
Unit_Price       0
Quantity         0
Discount         0
Total_Price      0
Region           0
Order_Date       0
dtype: int64

In [5]:
# Renaming columns according to snake casing for better readability and documentation

print(df.columns == df.columns.str.lower())
print(df.columns == df.columns.str.replace(' ','_'))
print(df == df.rename(columns={'purchase_amount_(usd)':'purchase_amount'}))

[False False False False False False False False False False False]
[False  True  True  True  True  True  True  True  True  True  True]
       Order_ID      Customer_ID  Customer_Type  Product  Category  \
0              True         True           True     True      True
1              True         True           True     True      True
2              True         True           True     True      True
3              True         True           True     True      True
4              True         True           True     True      True
...             ...          ...            ...      ...       ...
39995          True         True           True     True      True
39996          True         True           True     True      True
39997          True         True           True     True      True
39998          True         True           True     True      True
39999          True         True           True     True      True

       Unit_Price  Quantity  Discount  Total_Price  Region  Order_Date
0            True      True      True         True    True        True
1            True      True      True         True    True        True
2            True      True      True         True    True        True
3            True      True      True         True    True        True
4            True      True      True         True    True        True
...           ...       ...       ...          ...     ...         ...
39995        True      True      True         True    True        True
39996        True      True      True         True    True        True
39997        True      True      True         True    True        True
39998        True      True      True         True    True        True
39999        True      True      True         True    True        True

[40000 rows x 11 columns]

In [6]:
df.columns

Index(['Order_ID    ', 'Customer_ID', 'Customer_Type', 'Product', 'Category',
       'Unit_Price', 'Quantity', 'Discount', 'Total_Price', 'Region',
       'Order_Date'],
      dtype='object')

In [7]:
df.describe(include='all')

,Order_ID,Customer_ID,Customer_Type,Product,Category,Unit_Price,Quantity,Discount,Total_Price,Region,Order_Date
count,40000,40000,40000,40000,40000,40000.000000,40000.000000,40000.000000,40000.000000,40000,40000
unique,13273,7411,2,47,4,NaN,NaN,NaN,NaN,16,1094
top,ORD20064,CUS5167,B2C,Hohes C Orange,Water,NaN,NaN,NaN,NaN,Niedersachsen,21-05-2022
freq,5,27,25747,1506,10040,NaN,NaN,NaN,NaN,2675,77
mean,NaN,NaN,NaN,NaN,NaN,5.839573,23.146350,0.029739,131.170674,NaN,NaN
std,NaN,NaN,NaN,NaN,NaN,14.577078,26.907849,0.044760,509.376402,NaN,NaN
min,NaN,NaN,NaN,NaN,NaN,0.320000,1.000000,0.000000,0.310000,NaN,NaN
25%,NaN,NaN,NaN,NaN,NaN,1.050000,6.000000,0.000000,8.400000,NaN,NaN
50%,NaN,NaN,NaN,NaN,NaN,1.750000,11.000000,0.000000,21.150000,NaN,NaN
75%,NaN,NaN,NaN,NaN,NaN,3.210000,30.000000,0.050000,70.820000,NaN,NaN
max,NaN,NaN,NaN,NaN,NaN,135.040000,100.000000,0.150000,11667.460000,NaN,NaN

In [8]:
df.isnull().sum()

Order_ID         0
Customer_ID      0
Customer_Type    0
Product          0
Category         0
Unit_Price       0
Quantity         0
Discount         0
Total_Price      0
Region           0
Order_Date       0
dtype: int64

In [9]:
# Renaming columns according to snake casing for better readability and documentation

df.columns = df.columns.str.lower()
df.columns = df.columns.str.replace(' ','_')
df = df.rename(columns={'unit_price_(usd)':'unit_price'})

In [10]:
df.columns

Index(['order_id____', 'customer_id', 'customer_type', 'product', 'category',
       'unit_price', 'quantity', 'discount', 'total_price', 'region',
       'order_date'],
      dtype='object')

In [11]:
df.head(5)

,order_id____,customer_id,customer_type,product,category,unit_price,quantity,discount,total_price,region,order_date
0,ORD13428,CUS4637,B2B,Rauch Multivitamin,Juices,4.08,73,0.15,253.16,Niedersachsen,02-06-2023
1,ORD13428,CUS4637,B2B,Vittel,Water,0.78,83,0.10,58.27,Niedersachsen,02-06-2023
2,ORD13428,CUS4637,B2B,Merlot,Alcoholic Beverages,8.97,69,0.10,557.04,Niedersachsen,02-06-2023
3,ORD13428,CUS4637,B2B,Erdinger Weißbier,Alcoholic Beverages,1.79,21,0.05,35.71,Niedersachsen,02-06-2023
4,ORD13429,CUS9039,B2B,Gerolsteiner,Water,0.92,79,0.05,69.05,Bremen,08-04-2023

In [12]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40000 entries, 0 to 39999
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_id____   40000 non-null  object
 1   customer_id    40000 non-null  object
 2   customer_type  40000 non-null  object
 3   product        40000 non-null  object
 4   category       40000 non-null  object
 5   unit_price     40000 non-null  float64
 6   quantity       40000 non-null  int64
 7   discount       40000 non-null  float64
 8   total_price    40000 non-null  float64
 9   region         40000 non-null  object
 10  order_date     40000 non-null  object
dtypes: float64(3), int64(1), object(7)
memory usage: 3.4+ MB

         unit_price      quantity      discount   total_price
count  40000.000000  40000.000000  40000.000000  40000.000000
mean       5.839573     23.146350      0.029739    131.170674
std       14.577078     26.907849      0.044760    509.376402
min        0.320000      1.000000      0.000000      0.310000
25%        1.050000      6.000000      0.000000      8.400000
50%        1.750000     11.000000      0.000000     21.150000
75%        3.210000     30.000000      0.050000     70.820000
max      135.040000    100.000000      0.150000  11667.460000

In [18]:
# create a new column 'Discount_applied' based on the 'Discount' column
bins = [0, 0.05, 0.10, 0.15, 0.20]
labels = ['5%', '10%', '15%', '20%']
df['Discount_applied'] = pd.cut(
    df['Discount'],
    bins=bins,
    labels=labels,
    include_lowest=True)

In [ ]:
# Converting 'Order_Date' to datetime format and extracting the year into a new column 'Order_Year'
df['Order_Date'] = pd.to_datetime(df['Order_Date'], dayfirst=True)
df['Order_Year'] = df['Order_Date'].dt.year

In [46]:
df[['Order_Date', 'Order_Year']].head(10)

  Order_Date  Order_Year
0 2023-06-02        2023
1 2023-06-02        2023
2 2023-06-02        2023
3 2023-06-02        2023
4 2023-04-08        2023
5 2022-03-12        2022
6 2022-03-12        2022
7 2022-03-12        2022
8 2022-03-12        2022
9 2022-03-12        2022

In [26]:
# Creating a new column Gross_sales
df['Gross_Sales'] = df['Unit_Price'] * df['Quantity']

In [45]:
df[['Gross_Sales','Total_Price']].head(10)

   Gross_Sales  Total_Price
0       297.84       253.16
1        64.74        58.27
2       618.93       557.04
3        37.59        35.71
4        72.68        69.05
5         1.88         1.88
6         3.21         3.21
7         3.84         3.84
8        38.88        38.88
9         8.64         8.64

In [29]:
# Creating a new column Net_Sales 
df['Net_Sales'] = df['Gross_Sales'] * (1 - df['Discount'])

In [40]:
df[['Net_Sales', 'Gross_Sales']].head(10)

   Net_Sales  Gross_Sales
0   253.1640       297.84
1    58.2660        64.74
2   557.0370       618.93
3    35.7105        37.59
4    69.0460        72.68
5     1.8800         1.88
6     3.2100         3.21
7     3.8400         3.84
8    38.8800        38.88
9     8.6400         8.64

In [38]:
# Creating a new column Order_Size for categorizing orders based on quantity
df['Order_Size'] = np.where(df['Quantity'] <= 5, 'Small', 
                            np.where(df['Quantity'] <= 20 , 'Medium', 'Large')
                            )

In [39]:
df[['Quantity', 'Order_Size']].head(20)

    Quantity Order_Size
0         73      Large
1         83      Large
2         69      Large
3         21      Large
4         79      Large
5          4      Small
6          1      Small
7          4      Small
8          3      Small
9          9     Medium
10        12     Medium
11         5      Small
12         2      Small
13         6     Medium
14        12     Medium
15         4      Small
16        13     Medium
17         6     Medium
18         4      Small
19        63      Large

In [35]:
df.columns

Index(['Order_ID    ', 'Customer_ID', 'Customer_Type', 'Product', 'Category',
       'Unit_Price', 'Quantity', 'Discount', 'Total_Price', 'Region',
       'Order_Date', 'Discount_applied', 'Order_Year', 'Gross_Sales',
       'Net_Sales', 'Order_Size'],
      dtype='object')

In [ ]:
print(df.columns)

Index(['order_id____', 'customer_id', 'customer_type', 'product', 'category',
       'unit_price', 'quantity', 'discount', 'total_price', 'region',
       'order_date'],
      dtype='object')

In [ ]:
df[['Discount', 'Discount_applied']].head()
df['Discount_applied'].value_counts()

Discount_applied
5%     32131
10%     6200
15%     1669
20%        0
Name: count, dtype: int64

In [ ]:
print(df.columns)

Index(['Order_ID', 'Customer_ID', 'Customer_Type', 'Product', 'Category',
       'Unit_Price', 'Quantity', 'Discount', 'Total_Price', 'Region',
       'Order_Date', 'Discount_applied'],
      dtype='object')

In [ ]:
df[['Discount', 'Discount_applied']].head()

   Discount Discount_applied
0      0.15              15%
1      0.10              10%
2      0.10              10%
3      0.05               5%
4      0.05               5%

In [ ]:
df.columns = [col.strip().replace(' ', '_').replace('%', 'applied') for col in df.columns]

In [14]:
pip install pymysql sqlalchemy

Requirement already satisfied: pymysql in c:\users\tk\anaconda3\lib\site-packages (1.1.2)
Requirement already satisfied: sqlalchemy in c:\users\tk\anaconda3\lib\site-packages (2.0.34)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\tk\anaconda3\lib\site-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\tk\anaconda3\lib\site-packages (from sqlalchemy) (3.0.1)
Note: you may need to restart the kernel to use updated packages.

In [ ]:
from sqlalchemy import create_engine

# MySQL connection
username = "root"
password = "root"
host = "localhost"
port = "3306"
database = "sales_db"

engine = create_engine(f"mysql+pymysql://{username}:{password}@{host}:{port}/{database}")

# Write DataFrame to MySQL
table_name = "beverage_sales"   # choose any table name
df.to_sql(table_name, engine, if_exists="replace", index=False)

# Read back sample
pd.read_sql("SELECT * FROM beverage_sales LIMIT 5;", engine)

,Order_ID,Customer_ID,Customer_Type,Product,Category,Unit_Price,Quantity,Discount,Total_Price,Region,Order_Date,Discount_applied
0,ORD13428,CUS4637,B2B,Rauch Multivitamin,Juices,4.08,73,0.15,253.16,Niedersachsen,02-06-2023,15%
1,ORD13428,CUS4637,B2B,Vittel,Water,0.78,83,0.10,58.27,Niedersachsen,02-06-2023,10%
2,ORD13428,CUS4637,B2B,Merlot,Alcoholic Beverages,8.97,69,0.10,557.04,Niedersachsen,02-06-2023,10%
3,ORD13428,CUS4637,B2B,Erdinger Weißbier,Alcoholic Beverages,1.79,21,0.05,35.71,Niedersachsen,02-06-2023,5%
4,ORD13429,CUS9039,B2B,Gerolsteiner,Water,0.92,79,0.05,69.05,Bremen,08-04-2023,5%

In [ ]:
df.columns = [col.strip().replace(' ', '_')
                        .replace('%', 'perc')
                        .replace('#', 'num')
                        .replace('/', '_') for col in df.columns]

In [19]:
df.columns

Index(['Order_ID    ', 'Customer_ID', 'Customer_Type', 'Product', 'Category',
       'Unit_Price', 'Quantity', 'Discount', 'Total_Price', 'Region',
       'Order_Date', 'Discount_applied'],
      dtype='object')